import numpy as np
def calc(Jday):
    T = (Jday - 2451545) / 36525
    #平距角(日月对地心的角距离)
    D = np.radians(297.85036 + 445267.111480 * T - 0.0019142 * T ** 2 + T ** 3 / 189474)
    #太阳平近点角(太阳在黄道上的位置)
    M = np.radians(357.52772 + 35999.050340 * T - 0.0001603 * T ** 2 - T ** 3 / 300000)
    #月亮平近点角(月亮在黄道上的位置)
    M_ = np.radians(134.96298 + 477198.867398 * T + 0.0086972 * T ** 2 + T ** 3 / 56250)
    #月球纬度参数
    F = np.radians(93.27191 + 483202.017538 * T - 0.0036825 * T ** 2 + T ** 3 / 327270)
    #黄道与月球平轨道升交点黄经，从 Date 黄道平分点开始算起
    O = np.radians(125.04452 - 1934.136261 * T + 0.0020708 * T ** 2 + T ** 3 / 450000)
    return D,M,M_,F,O
    
